In [8]:
# A short simple conditional statement exercise
name = input('Your Name ')
age = int(input('Your Age '))

if age >= 18:
    print(f'{name} is an adult')
elif age >= 13:
    print(f'{name} is a teenager')
else:
    print(f'{name} is an toddler')

Your Name Emmy
Your Age 9
Emmy is an toddler

In [12]:
# A short simple conditional statement exercise
name = input('Your Name ')
age = int(input('Your Age '))

if age >= 18:
    print(f'{name} is an adult')
elif age in range(13,18):
    print(f'{name} is a teenager')
elif age in range(0,13):
    print(f'{name} is an toddler')

Your Name Emmy
Your Age 8
Emmy is an toddler

In [1]:
# Importing the pandas library as pd
import pandas as pd

In [2]:
# Creating a series in pandas
l = [1,2,3,4,5]
a = pd.Series(l)

In [3]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
type(a)

pandas.core.series.Series

In [5]:
# Creating a DataFrame in Pandas
d = {'a':[1,2,3,4], 'b':[5,6,7,8], 'c':[9,10,11,12]}

In [6]:
b = pd.DataFrame(d)

In [7]:
b

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [8]:
# Creating another DataFrame with Pandas
e = {'name' : ['Emmanuel', 'Hope', 'Rita', 'Austin'],
     'gender' : ['male', 'female', 'female', 'male'],
     'age' : [24, 27, 26,29]
    }

In [9]:
f = pd.DataFrame(e)

In [10]:
f

       name  gender  age
0  Emmanuel    male   24
1      Hope  female   27
2      Rita  female   26
3    Austin    male   29

In [12]:
# Selecting a single column in the DataFrame
b['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [13]:
# Selecting a single column in the DataFrame
f['name']

0    Emmanuel
1        Hope
2        Rita
3      Austin
Name: name, dtype: object

In [14]:
# Selecting multiple columns in the DataFrame
b[['a','c','b']]

   a   c  b
0  1   9  5
1  2  10  6
2  3  11  7
3  4  12  8

In [15]:
# Selecting multiple columns in the DataFrame
f[['name', 'age', 'gender']]

       name  age  gender
0  Emmanuel   24    male
1      Hope   27  female
2      Rita   26  female
3    Austin   29    male

In [35]:
# How to use .loc to select subset of the pandas DataFrame
f.loc[1:2]

   name  gender  age
1  Hope  female   27
2  Rita  female   26

In [36]:
# How to use .loc to select subset of the pandas DataFrame
f.loc[1:2, 'name']

1    Hope
2    Rita
Name: name, dtype: object

In [37]:
# Selecting a subset of the dataframe using .loc
f.loc[1:2, ('name', 'age')]

   name  age
1  Hope   27
2  Rita   26

In [40]:
# How to use .iloc to select subset of the pandas DataFrame
f.iloc[1:3]

   name  gender  age
1  Hope  female   27
2  Rita  female   26

In [41]:
# Selecting a subset of the dataframe using .loc
f.iloc[1:3, 0:2]

   name  gender
1  Hope  female
2  Rita  female

In [16]:
# using .describe
# It output the statistical summary of any column 
# that has numerical values 
b.describe()

              a         b          c
count  4.000000  4.000000   4.000000
mean   2.500000  6.500000  10.500000
std    1.290994  1.290994   1.290994
min    1.000000  5.000000   9.000000
25%    1.750000  5.750000   9.750000
50%    2.500000  6.500000  10.500000
75%    3.250000  7.250000  11.250000
max    4.000000  8.000000  12.000000

In [17]:
f.describe()

             age
count   4.000000
mean   26.500000
std     2.081666
min    24.000000
25%    25.500000
50%    26.500000
75%    27.500000
max    29.000000